config_loop.yml
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

config:
  target: "http://ekko-ekkos-YK9SB7GQBXVU-1280264013.us-east-2.elb.amazonaws.com/loadtest"
  engines:
    socketio-v3: {}
  socketio:
    transports: ["websocket"]
    auth:
      jwt: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhZG1pbiI6dHJ1ZSwiYXBwTmFtZSI6ImxvYWR0ZXN0IiwiaWF0IjoxNjIxNTU2MTM2fQ.TFcvBGww4qgg04snU59En9pJEESD2otToqkdASn-FZg"
      uuid: "hi"
  phases:
    - duration: 100
      arrivalRate: 1

scenarios:
  - name: A chatty user
    engine: socketio-v3
    flow:
      - emit: ["subscribe", { channels: ["greeting"], uuid: "nobody" }]
      - think: 5
      - loop:
          - emit:
              [
                "publish",
                { channel: "greeting", message: { text: "my message" } },
              ]
          - think: 10
        count: 10
      - think: 100